In [ ]:
## As a bonus to the SQL homework, we're asked to:
# 1)Create a histogram to visualize the most common salary ranges for employees.
# 2)Create a bar chart of average salary by title.

In [10]:
## Import the SQL database into Pandas
#(whew: see notes at bottom, got this fixed before hw due.)

In [50]:
## we were given this code as a starting point::

# from sqlalchemy import create_engine
# engine = create_engine('postgresql://localhost:5432/<your_db_name>')
# connection = engine.connect()

In [51]:
from sqlalchemy.ext.declarative import declarative_base
Base = declarative_base()
from sqlalchemy import Column, Integer, String, Float
from sqlalchemy import create_engine, inspect
from sqlalchemy.sql import func
import pandas as pd
import matplotlib
from matplotlib import style
style.use('seaborn')
import matplotlib.pyplot as plt

In [52]:
dbuser = 'postgres'
dbpassword = 'postgres'
dbhost = 'localhost'
dbport = '5432'
dbname= 'Pewlett_Hackard3'

engine = create_engine(f"postgres://{dbuser}:{dbpassword}@{dbhost}:{dbport}/{dbname}")
Base.metadata.create_all(engine)

In [53]:
print(f"postgres://{dbuser}:{dbpassword}@{dbhost}:{dbport}/{dbname}")

postgres://postgres:postgres@localhost:5432/Pewlett_Hackard3

In [54]:
connection = engine.connect()

In [55]:
inspector = inspect(engine)
inspector.get_table_names()

['Titles', 'Employees', 'Departments', 'Dept_Emp', 'Dept_Manager', 'Salaries']

In [56]:
# I know that I need values from Employees, Titles, and Salaries
# I will need to join Employees and Salaries on the emp_no column
# I will then nee to joing Titles to this combo on the emp_title_id column

# Taking a look at my tables:

In [57]:
### I came back up here and tried this code block because I was getting the 0,1,2,3... column numbers;
### not the column names.  Having trouble with the .groupby() for prepping the data for plotting. 

# df_emp = pd.DataFrame(engine.execute('SELECT * FROM "Employees" ').fetchall())
# df_emp

In [58]:
engine.execute('SELECT "Employees".emp_no, "Employees".emp_title_id FROM "Employees" LIMIT 5').fetchall()

[(473302, 's0001'),
 (475053, 'e0002'),
 (57444, 'e0002'),
 (421786, 's0001'),
 (282238, 'e0003')]

In [59]:
pd1 = pd.DataFrame(engine.execute('SELECT "Employees".emp_no,\
        "Employees".emp_title_id FROM "Employees" LIMIT 5').fetchall())
pd1

## no matter the method I try, I keep getting 0, 1 for the column headers.  I've got to be pulling it in incorrectly.

        0      1
0  473302  s0001
1  475053  e0002
2   57444  e0002
3  421786  s0001
4  282238  e0003

In [60]:
## I can actually sort the salaries by job title here, but again, can't figure my columns out::

# pd2 = pd1.groupby(['1']).mean()




# 72nd try -- going to try automap here..

In [61]:
# import sqlalchemy
# from sqlalchemy.orm import Session
# from sqlalchemy.ext.automap import automap_base
# from sqlalchemy import create_engine
# import os

# session = Session(bind=engine)

In [62]:
# Base = automap_base()
# Base.prepare(engine, reflect=True)
# Base.classes.keys()

### ok this produces that df keys I want!

['Titles', 'Employees', 'Departments']

In [63]:
engine.execute('SELECT * FROM "Titles" LIMIT 5').fetchall()

[('\ufefftitle_id', 'title'),
 ('s0001', 'Staff'),
 ('s0002', 'Senior Staff'),
 ('e0001', 'Assistant Engineer'),
 ('e0002', 'Engineer')]

In [64]:
engine.execute('SELECT * FROM "Salaries" LIMIT 5').fetchall()

[(10001, 60117),
 (10002, 65828),
 (10003, 40006),
 (10004, 40054),
 (10005, 78228)]

In [84]:
# import sqlite3
# conn = sqlite3.connect('''Pewlett_Hackard3.sqlite''')
# cur = conn.cursor()

employees = engine.execute('SELECT "Employees".emp_no, "Salaries".salary, "Employees".emp_title_id\
                FROM "Employees"\
                JOIN "Salaries"\
                ON "Salaries".emp_no = "Employees".emp_no\
                JOIN "Titles"\
                ON "Titles".title_id = "Employees".emp_title_id\
                      ').fetchall()

#df2 = pd.DataFrame(cur.fetchall())
#GROUP BY "Titles".title_id

df_emp = pd.DataFrame(employees)
df_emp

# df_emp = pd.DataFrame(engine.fetchall())
# df_emp.columns = [x[0] for x in engine.description]
# df_emp.columns ???

             0      1      2
0        10005  78228  s0001
1        10010  72488  e0002
2        10011  42365  s0001
3        10018  55881  e0003
4        10035  41538  e0003
...        ...    ...    ...
300019  499963  49383  e0003
300020  499972  41002  e0003
300021  499985  40000  s0001
300022  499987  52282  s0001
300023  499998  40000  s0001

[300024 rows x 3 columns]

In [85]:
df_emp2.keys()

Int64Index([0, 1, 2], dtype='int64')

In [86]:
# I'm going to try to change these column names:

df_emp2 = df_emp.rename(columns={"0":"Employee_ID", "1":"Salary", "2":"Position_ID"})
df_emp2

             0      1      2
0        10005  78228  s0001
1        10010  72488  e0002
2        10011  42365  s0001
3        10018  55881  e0003
4        10035  41538  e0003
...        ...    ...    ...
300019  499963  49383  e0003
300020  499972  41002  e0003
300021  499985  40000  s0001
300022  499987  52282  s0001
300023  499998  40000  s0001

[300024 rows x 3 columns]

In [87]:
#df_salaries = df_emp2.groupby('2')

In [ ]:
### So close! I need to groupby(['2'])  <-- what the df above is calling column 2.
### this would group the data by position title and I could do an mean() method to obtain the average salary@position

### and then I use the matplotlib plotting techniques we've learned prior in class to plot data on bars. 

# df_salaries = df_employees.groupby(['2'])
# print(df_salaries)

In [ ]:
plt.bar(x_axis, ___whateverIcallit__ , color="b", alpha=0.5, align="center")
plt.xticks(x_axis, __whateverIcallthepositions__) 
plt.xlim(-0.75, len(x_axis)-0.25)
plt.ylim(0, max(__whatever__)*1.05)
plt.title("Pewlett Hackard Salaries")
plt.xlabel("Position")
plt.ylabel("Average Salary")

In [ ]:
output_path = os.path.join("..", "Images", "pewletthackard_sal.png")
plt.savefig(output_path)
plt.show()

In [ ]:
# df_emp = pd.read_sql('SELECT "Employees".emp_no)

In [68]:
# this seems useful...
# session.query(Table.column, func.count(Table.column)).group_by(Table.column).all()

In [69]:
### df_employees is not giving me the column headings that I'm seeing in PGADMIN -- trying this read_sql funct

# def load_sqlite_table(engine, Employees):
#     #Returns (table, connection). table is a pandas DataFrame
#     conn = sqlite3.connect(engine)
#     try:
#         df = pd.read_sql("SELECT * FROM %s" % Employees, conn)
#         #  print("\nLoading %s table from SQLite3 database." % table_name)
#     except DatabaseError as e:
#         if 'no such table' in e.args[0]:
#             print("\nNo such table: %s" % Employees)
#             print("Create the table before loading it. " +
#                   "Consider using the create_sqlite_table function")
#             raise DatabaseError
#         else:
#             print(e)
#             raise Exception("Failed to create %s table. Unknown error." %
#                             Employees)
#     return df, conn

# couldn't get any of this to work either.

In [76]:
### Some notes during tutor session

## seesions builds the query for you
## execute allows you to write out the raw query 


## look up having clause 


# SELECT * FROM Employees e
# LEFT JOIN Salaries s ON
# (e.emp_no == s.emp_no)
# LEFT JOIN title t ON
# (e.emp_title == t.title_id)
# ORDER BY

In [ ]:
# same_sporder = session.query(EA.sporder,
#                              EA.family,
#                              EA.genus,
#                              EA.species,
#                              NA.family,
#                              NA.genus,
#                              NA.species).filter(EA.sporder == NA.sporder).limit(10)

In [ ]:
# Loading some more examples here to pull from:

In [ ]:
# from sqlalchemy.orm import sessionmaker
# Session = sessionmaker(bind = engine)
# session = Session()

# for c, i in session.query(Customer, Invoice).filter(Customer.id == Invoice.custid).all():
#    print ("ID: {} Name: {} Invoice No: {} Amount: {}".format(c.id,c.name, i.invno, i.amount))

In [ ]:
## example from class

# stmt = session.query(
#    Invoice.custid, func.count('*').label('invoice_count')
# ).group_by(Invoice.custid).subquery()

In [ ]:
## When we were asked to run these lines of code on Thursday before class (SQL_1):
# conda install - c anaconda sqlite
# conda install - c anaconda sqlalchemy
# pip install psychopg2

# this last line gave me some errors, and the instructor asked to do a brew install of the same items 
# What I think we just found out yesterday that is created another user. 
# So now, I'm getting a password error every time I try to access pgAdmin from Jupyter. 
# We worked for about an hour to troubleshoot different ways of access, no luck.
# The solution that was brought forth was to uninstall and reinstall postgresQL / pgAdmin.
# This would obvious delete all the data / examples / work I've put into class until now,
# ...which I don't really want to do.

# I wanted to get the homework completed and submitted before attempting any of this,
# ...but unfortuately I (obviously) that part working for this bonus.

# I'm going to show a few steps here to prove my understanding of the exercise in hopes of a few points anyway:



# Got with Kirby/Justin TA's who finally figured it out.  I was using a password with % in it.
# I've learned this cannot be used when calling a url outside of the normal % function. 
# This created tons of problems... we also tried: 
#### from urllib.parse import quote_plus
# and placing the 'quote_plus()' around the password.  I think what we did wrong here was didn't do the same in the 
# url call. 
# after many many hours... it's working.  lessoned learned, just used postgres as password, ha.